app/controllers/merchant/merchant_stores_controller.rb

SELECT `merchant_stores`.* FROM `merchant_stores`   ORDER BY `merchant_stores`.`created_at` DESC
SELECT  `merchant_stores`.* FROM `merchant_stores`   ORDER BY `merchant_stores`.`created_at` DESC LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM `merchant_stores`
---
    def index
      @q = Merchant::MerchantStore.search(params[:q])
      @merchant_stores = @q.result.order(created_at: :desc).paginate(page: @page, per_page: @limit)

SELECT `acquirer_org`.* FROM `acquirer_org`
---
    def new
      @merchant_store = Merchant::MerchantStore.new
      @acquire_orgs = Merchant::AcquirerOrg.all

INSERT INTO `merchant_stores` (`accept_global_voucher`, `accquire_org_id`, `business_scope`, `clearance_account_bank`, `clearance_account_name`, `clearance_account_num`, `contract_num`, `contractor`, `created_at`, `deploy_contact_name`, `deploy_contact_phone`, `file_num`, `finance_contact_name`, `finance_contact_phone`, `legal_person`, `legal_person_ic`, `license_name`, `license_num`, `merchant_number`, `name`, `public_account_bank`, `public_account_name`, `public_account_num`, `real_address`, `real_business_scope`, `register_address`, `standard_rate`, `status`, `tax_number`, `updated_at`) VALUES (0, 1, '', '', '', '', '', '', '2014-08-27 03:48:13', '', '', '', '', '', '', '', '', '', '10141001', 'aaabbc', '', '', '', '', '', '', 1.0, 'editing', '', '2014-08-27 03:48:13')
---
    def create
      @merchant_merchant_store = Merchant::MerchantStore.new(merchant_merchant_store_params)

      respond_to do |format|
        if @merchant_merchant_store.save

SELECT  `merchant_stores`.* FROM `merchant_stores`  WHERE `merchant_stores`.`id` = 30 LIMIT 1
---
    def set_merchant_merchant_store
      @merchant_merchant_store = Merchant::MerchantStore.find(params[:id])