app/views/merchant/merchant_stores/_form.html.erb

        <div class="col-sm-10">
            <%= f.select :accquire_org_id, options_from_collection_for_select(Merchant::AcquirerOrg.all, :id, :acquirer_name, @merchant_store.acquire_org.try(:id)), {}, class: 'form-control', 'data-bv-notempty' => true %>
---
SELECT `acquirer_org`.* FROM `acquirer_org`