app/controllers/sessions_controller.rb

  def create
    unless valid_captcha? params[:captcha].to_s.upcase
      flash[:error] = '验证码错误'
      redirect_to :root and return
    end
    destroy_session
    system_user = Users::SystemUser.where({:name => params[:username]}).first
---
SELECT  `system_users`.* FROM `system_users`  WHERE `system_users`.`name` = '1'  ORDER BY `system_users`.`id` ASC LIMIT 1